# **Importing Library**

In [4]:
import numpy as np
import pandas as pd

# **Entering the data in Dict. Format**

In [6]:

Data = {
    'Name': ['Yash', 'Ramesh', 'Struti', 'Rohit', 'Priya', 'Jatin'],
    'Age': [22, 23, 110, 22, 23, 22],
    'Income': [22000, 22000, 1000000000000, 22000, 21000, 23000],
    'Gender': ['M', 'M', 'F', 'Male', 'M', 'F'],
    'Marks': [95, 92, 93, np.nan, 90, 92]
}

df=pd.DataFrame(Data)#using Dataframe function for printing dic. data in tabular form

In [7]:
print(df)

     Name  Age         Income Gender  Marks
0    Yash   22          22000      M   95.0
1  Ramesh   23          22000      M   92.0
2  Struti  110  1000000000000      F   93.0
3   Rohit   22          22000   Male    NaN
4   Priya   23          21000      M   90.0
5   Jatin   22          23000      F   92.0

In [8]:
df['Marks'].fillna(df['Marks'].mean(), inplace=True)#filling the NAN value

In [9]:
print(df)

     Name  Age         Income Gender  Marks
0    Yash   22          22000      M   95.0
1  Ramesh   23          22000      M   92.0
2  Struti  110  1000000000000      F   93.0
3   Rohit   22          22000   Male   92.4
4   Priya   23          21000      M   90.0
5   Jatin   22          23000      F   92.0

In [13]:
df['Gender'].replace('Male','M',inplace=True)#replacing the value
print(df)

     Name  Age         Income Gender  Marks
0    Yash   22          22000      M   95.0
1  Ramesh   23          22000      M   92.0
2  Struti  110  1000000000000      F   93.0
3   Rohit   22          22000      M   92.4
4   Priya   23          21000      M   90.0
5   Jatin   22          23000      F   92.0

In [16]:
df.loc[df['Age']>100,'Age']=np.nan#Truning Value NAN
print(df)

     Name   Age         Income Gender  Marks
0    Yash  22.0          22000      M   95.0
1  Ramesh  23.0          22000      M   92.0
2  Struti   NaN  1000000000000      F   93.0
3   Rohit  22.0          22000      M   92.4
4   Priya  23.0          21000      M   90.0
5   Jatin  22.0          23000      F   92.0

In [18]:
df['Age'].fillna(df['Age'].mean(),inplace=True)#filling the NAN value
print(df)

     Name   Age         Income Gender  Marks
0    Yash  22.0          22000      M   95.0
1  Ramesh  23.0          22000      M   92.0
2  Struti  22.4  1000000000000      F   93.0
3   Rohit  22.0          22000      M   92.4
4   Priya  23.0          21000      M   90.0
5   Jatin  22.0          23000      F   92.0

In [20]:
q3=df['Income'].quantile(0.75)
q1=df['Income'].quantile(0.25)
IQR=q3-q1
upper_limit=q3+1.5*IQR
lower_limit=q1-1.5*IQR
print(upper_limit)
print(lower_limit)

23875.0
20875.0

In [22]:
df.loc[df['Income']>upper_limit,'Income']=upper_limit
df.loc[df['Income']<lower_limit,'Income']=lower_limit
print(df)#Filling the noise value with Upper and lower limit

     Name   Age  Income Gender  Marks
0    Yash  22.0   22000      M   95.0
1  Ramesh  23.0   22000      M   92.0
2  Struti  22.4   23875      F   93.0
3   Rohit  22.0   22000      M   92.4
4   Priya  23.0   21000      M   90.0
5   Jatin  22.0   23000      F   92.0

In [32]:
Additional_data={
    'Name': ['Yash', 'Ramesh', 'Struti', 'Rohit', 'Priya', 'Jatin'],
    'Location': ['City 1', 'City 2', 'City 3', 'City 4', 'City 5', 'City 6'],
    'Scholarship':[True,False,True,True,True,False]
}
DF2=pd.DataFrame(Additional_data)

In [34]:
print(DF2)
print(df)

     Name Location  Scholarship
0    Yash   City 1         True
1  Ramesh   City 2        False
2  Struti   City 3         True
3   Rohit   City 4         True
4   Priya   City 5         True
5   Jatin   City 6        False
     Name   Age  Income Gender  Marks
0    Yash  22.0   22000      M   95.0
1  Ramesh  23.0   22000      M   92.0
2  Struti  22.4   23875      F   93.0
3   Rohit  22.0   22000      M   92.4
4   Priya  23.0   21000      M   90.0
5   Jatin  22.0   23000      F   92.0

In [35]:
Merge=pd.merge(df,DF2,on='Name')#Merging the data
print(Merge)

     Name   Age  Income Gender  Marks Location  Scholarship
0    Yash  22.0   22000      M   95.0   City 1         True
1  Ramesh  23.0   22000      M   92.0   City 2        False
2  Struti  22.4   23875      F   93.0   City 3         True
3   Rohit  22.0   22000      M   92.4   City 4         True
4   Priya  23.0   21000      M   90.0   City 5         True
5   Jatin  22.0   23000      F   92.0   City 6        False

In [36]:
Merge.to_csv('merged_Data.csv', index=False)